/**
 * @author 王志勇
 * @description 常用错误提示
 * @description  
 * create date 2016-03-24
 * edit date:2018-01-05
 */
export default {
    email: /\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*/,
    //注意这里要忽略大写
    url: /[-a-zA-Z0-9@:%._\+~#=]{2,256}\.[a-z]{2,6}\b([-a-zA-Z0-9@:%_\+.~#?&//=]*)/i,
    number: /^\s*(\-|\+)?(\d+|(\d*(\.\d+)))\s*$/,
    date: /^(\d{4})-(\d{2})-(\d{2})$/,//日期
    datetime:/(\d{4}-\d{2}-\d{2}\d{2}:\d{2}:\d{2})|(\d{2}-\d{2}\d{2}:\d{2}:\d{2})|(\d{2}:\d{2}:\d{2})$/,
    daterange:/^(\d{4})-(\d{2})-(\d{2}),(\d{4})-(\d{2})-(\d{2})$/,
    datetimerange:/(\d{4}-\d{2}-\d{2}\d{2}:\d{2}:\d{2})|(\d{2}-\d{2}\d{2}:\d{2}:\d{2})|(\d{2}:\d{2}:\d{2}),(\d{4}-\d{2}-\d{2}\d{2}:\d{2}:\d{2})|(\d{2}-\d{2}\d{2}:\d{2}:\d{2})|(\d{2}:\d{2}:\d{2})$/,
   //只能包含英文字符，，"_"
    alpha: /^[a-z_]+$/i,
    //能包含数字、英文字符和"_"
    alphanum: /^[a-z0-9_]+$/i,
    //汉字
    chinese:/^[\u4e00-\u9fa5]+$/,
   //整数
    integer: /^[-+]?[0-9]+$/,
    /*
       add wangzhiyong
       date:2018-01-05 最新的
       desc：对手机号码的验证进行修改
       移动号段：
       134 135 136 137 138 139 147 150 151 152 157 158 159  178 182 183 184 187 188
       联通号段：
       130 131 132 145 155 156  176 185 186
       电信号段：
       133  153 173 177 180 181 189
       */
      mobile: /^(0|86|17951)?(13[0-9]|15[012356789]|17[678]|18[0-9]|14[57])[0-9]{8}$/,
        /*
         *身份证号码，注意这里是函数
        */
         idcard:function (value) {//身份证号码
        //15位和18位身份证号码的正则表达式
        var regIdCard = /^(^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$)|(^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])((\d{4})|\d{3}[Xx])$)$/;

        //如果通过该验证，说明身份证格式正确，但准确性还需计算
        if (regIdCard.test(value)) {
            if (value.length == 18) {
                var idCardWi = new Array(7, 9, 10, 5, 8, 4, 2, 1, 6, 3, 7, 9, 10, 5, 8, 4, 2); //将前17位加权因子保存在数组里
                var idCardY = new Array(1, 0, 10, 9, 8, 7, 6, 5, 4, 3, 2); //这是除以11后，可能产生的11位余数、验证码，也保存成数组
                var idCardWiSum = 0; //用来保存前17位各自乖以加权因子后的总和
                for (var i = 0; i < 17; i++) {
                    idCardWiSum += value.substring(i, i + 1) * idCardWi[i];
                }

                var idCardMod = idCardWiSum % 11;//计算出校验码所在数组的位置
                var idCardLast = value.substring(17);//得到最后一位身份证号码

                //如果等于2，则说明校验码是10，身份证号码最后一位应该是X
                if (idCardMod == 2) {
                    if (idCardLast == "X" || idCardLast == "x") {
                        return true;
                    } else {
                        return false;
                    }
                } else {
                    //用计算出的验证码与最后一位身份证号码匹配，如果一致，说明通过，否则是无效的身份证号码
                    if (idCardLast == idCardY[idCardMod]) {
                        return true;
                    } else {
                        return false;
                    }
                }
            }
        } else {
            return false;
        }


    },
    sql:/alert\s*\(|<script>|<\/script>|--/,//防止脚本注入，与sql注入
         //只能包含数字、英文字符和下划线，长度在6到20
    userName: /^[a-z0-9_]{6,20}$/i,
    //密码的强度必须是包含大小写字母和数字的组合，不能使用特殊字符，长度在8-16之间。
    password: /^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)[^]{8,16}$/,
}